In [2]:
import numpy as np
import pandas as pd
import seaborn as sns

In [3]:
df=sns.load_dataset("titanic")
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [4]:
type(df)

pandas.core.frame.DataFrame

In [5]:
df.dtypes

survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

In [6]:
df_number=df.select_dtypes(include=["float64","int64"])
df_number.head()

   survived  pclass   age  sibsp  parch     fare
0         0       3  22.0      1      0   7.2500
1         1       1  38.0      1      0  71.2833
2         1       3  26.0      0      0   7.9250
3         1       1  35.0      1      0  53.1000
4         0       3  35.0      0      0   8.0500

In [7]:
df_number.aggregate(["min", "max"])

     survived  pclass    age  sibsp  parch      fare
min         0       1   0.42      0      0    0.0000
max         1       3  80.00      8      6  512.3292

In [8]:
df_number["age"].min()

0.42

In [9]:
df_number.aggregate([np.median])

        survived  pclass   age  sibsp  parch     fare
median       0.0     3.0  28.0    0.0    0.0  14.4542

In [10]:
df_number.aggregate(["mean", np.median])

        survived    pclass        age     sibsp     parch       fare
mean    0.383838  2.308642  29.699118  0.523008  0.381594  32.204208
median  0.000000  3.000000  28.000000  0.000000  0.000000  14.454200

In [12]:
df_number.aggregate({"survived":"mean", "pclass":min, "age":"max"})

survived     0.383838
pclass       1.000000
age         80.000000
dtype: float64

In [14]:
def f(x):
    return x.mean() - x.std()

In [15]:
df_number.aggregate(f)

survived    -0.102754
pclass       1.472571
age         15.172620
sibsp       -0.579736
parch       -0.424464
fare       -17.489221
dtype: float64

In [17]:
f(df_number)

survived    -0.102754
pclass       1.472571
age         15.172620
sibsp       -0.579736
parch       -0.424464
fare       -17.489221
dtype: float64

In [18]:
df_number.aggregate([min, "mean", f])

      survived    pclass        age     sibsp     parch       fare
min   0.000000  1.000000   0.420000  0.000000  0.000000   0.000000
mean  0.383838  2.308642  29.699118  0.523008  0.381594  32.204208
f    -0.102754  1.472571  15.172620 -0.579736 -0.424464 -17.489221

In [19]:
fonksiyon = ["max", "mean", "std"]

In [20]:
df_number["age"].aggregate(fonksiyon)

max     80.000000
mean    29.699118
std     14.526497
Name: age, dtype: float64

In [21]:
df_number.aggregate(["sum","max"])

     survived  pclass       age  sibsp  parch        fare
sum       342    2057  21205.17    466    340  28693.9493
max         1       3     80.00      8      6    512.3292

In [ ]:
GROUPBY

In [24]:
import numpy as np
import pandas as pd
import seaborn as sns

In [25]:
df=sns.load_dataset("titanic")
df.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True

In [26]:
df.groupby("pclass").mean()

,survived,age,sibsp,parch,fare,adult_male,alone
pclass,,,,,,,
1,0.629630,38.233441,0.416667,0.356481,84.154687,0.550926,0.504630
2,0.472826,29.877630,0.402174,0.380435,20.662183,0.538043,0.565217
3,0.242363,25.140620,0.615071,0.393075,13.675550,0.649695,0.659878

In [32]:
df.groupby("pclass")["survived"].mean()
# Dataseries

pclass
1    0.629630
2    0.472826
3    0.242363
Name: survived, dtype: float64

In [34]:
df.groupby("pclass")[["survived"]].mean()
# Dataframe

        survived
pclass
1       0.629630
2       0.472826
3       0.242363

In [35]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [ ]:
# Toplam erkek ve kadın sayılarının bulunması.

In [38]:
df["sex"].value_counts()

male      577
female    314
Name: sex, dtype: int64

In [39]:
df.groupby("who")["sex"].count()

who
child     83
man      537
woman    271
Name: sex, dtype: int64

In [40]:
df.groupby(["sex"]).count()

,survived,pclass,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
sex,,,,,,,,,,,,,,
female,314,314,261,314,314,314,312,314,314,314,97,312,314,314
male,577,577,453,577,577,577,577,577,577,577,106,577,577,577

In [48]:
# Cinsiyete göre toplam kaç kişi hayatta kalmış.
# Erkeklerden kaç kişi hayatta kalmış, kaç kişi vefat etmiş.
# bayanlardan kaç kişi hayatta kalmış, kaç kişi vefat etmiş.

In [47]:
df.groupby(["sex"])["survived"].count()

sex
female    314
male      577
Name: survived, dtype: int64

In [45]:
df.groupby(["sex"])["survived"].value_counts().unstack()

survived    0    1
sex
female     81  233
male      468  109

In [44]:
# Hocamın cevabı
df.groupby("sex")["survived"].value_counts().unstack()

survived    0    1
sex
female     81  233
male      468  109

In [49]:
# Class lara göre kaç bayan kaç erkek seyahat etmiş

In [51]:
df.groupby("pclass")["sex"].value_counts().unstack()

sex     female  male
pclass
1           94   122
2           76   108
3          144   347

In [52]:
df.groupby("sex")["pclass"].value_counts().unstack()

pclass    1    2    3
sex
female   94   76  144
male    122  108  347

In [ ]:
# Cinsiyet ve clas a göre hayatta kalanların oranları tablo şekli

In [63]:
df.groupby(["sex","pclass"])["survived"].mean().unstack()

pclass         1         2         3
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [64]:
df.groupby(["sex","pclass"])[["survived"]].mean().unstack()

        survived
pclass         1         2         3
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [66]:
# Hayatta kalanlara göre cinsiyet vs. gruplanması
df["survived"].groupby([df["sex"],df["pclass"],df["class"]]).value_counts().unstack()

survived                0   1
sex    pclass class
female 1      First     3  91
       2      Second    6  70
       3      Third    72  72
male   1      First    77  45
       2      Second   91  17
       3      Third   300  47

In [ ]:
# cinsiyete göre class oranlaması

In [69]:
df["sex"].groupby(df["pclass"]).value_counts()

pclass  sex
1       male      122
        female     94
2       male      108
        female     76
3       male      347
        female    144
Name: sex, dtype: int64

In [75]:
df.groupby("sex")[["pclass"]].mean()

          pclass
sex
female  2.159236
male    2.389948

In [ ]:
# Cinsiyete göre clas larda kaç kişi setaj-hat etmiş.

In [73]:
df.groupby("sex")["pclass"].value_counts().unstack()

pclass    1    2    3
sex
female   94   76  144
male    122  108  347

In [76]:
# Cinsiyet pclass class ve hayatta kalma oranlarını

In [80]:
df.groupby(["sex","pclass","class"])[["survived"]].mean().unstack()

               survived
class             First    Second     Third
sex    pclass
female 1       0.968085       NaN       NaN
       2            NaN  0.921053       NaN
       3            NaN       NaN  0.500000
male   1       0.368852       NaN       NaN
       2            NaN  0.157407       NaN
       3            NaN       NaN  0.135447

In [79]:
df.groupby(["sex","pclass","class"])[["survived"]].mean()
# yatay tablo dikeye dönüşüyor.

                      survived
sex    pclass class
female 1      First   0.968085
              Second       NaN
              Third        NaN
       2      First        NaN
              Second  0.921053
              Third        NaN
       3      First        NaN
              Second       NaN
              Third   0.500000
male   1      First   0.368852
              Second       NaN
              Third        NaN
       2      First        NaN
              Second  0.157407
              Third        NaN
       3      First        NaN
              Second       NaN
              Third   0.135447